# Индексация и выборка данных

In [1]:
import numpy as np
import pandas as pd

## Выборка данных из объекта Series

### Объект Series как словарь

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

In [3]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [4]:
data['b']

0.5

Для просмотра ключей/индексов можно использовать методы языка Python, аналогичные для словарей:

In [5]:
'a' in data

True

In [6]:
data.items()

In [7]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [8]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
# объекты Series можно модифицировать с помощью синтаксиса, подобного синтаксису словарей
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

### Объект Series как одномерный массив

In [10]:
# срез посредством явного индекса
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [11]:
# срез просредством неявного целочисленного индекса
data[0:2]

a    0.25
b    0.50
dtype: float64

In [12]:
# маскирование
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [13]:
# "прихотливая" индексация
data[['a', 'e', 'b']]

a    0.25
e    1.25
b    0.50
dtype: float64

### Индексаторы: loc, iloc и ix

###Проблема### При наличии у объекта Series явного целочисленного индекса операция индексации (data[1]) будет использовать явные индексы, а операция среза (data[1:3]) - не явный индекс в стиле языка Python.

In [17]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [18]:
# использование явного индекса при индексации
data[1]

'a'

In [19]:
# использование неявного индекса при срезе
data[1:3]

3    b
5    c
dtype: object

Атрибут loc позволяет выполнить индексацию и срезы с использованием явного индекса:

In [20]:
data.loc[1]

'a'

In [21]:
data.loc[1:3]

1    a
3    b
dtype: object

Атрибут iloc дает возможность выполнить индексацию и срезы, применяя неявный индекс в стиле языка Python

In [22]:
data.iloc[1]

'b'

In [23]:
data.iloc[1:3]

3    b
5    c
dtype: object

Атрибут ix представляет собой гибрид loc и iloc и для объекта Series эквивалентен обычной индексации с помощью []. Рассмотрим в контексте объектов DataFrame.

## Выборка данных из объекта DataFrame

### Объект DataFrame как словарь

In [32]:
area = pd.Series({'California': 423967, 'Texas': 695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127, 'Florida': 19552860, 'Illinois': 12882135})
data = pd.DataFrame({'area': area, 'pop': pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [34]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [35]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [37]:
data.area is data['area']

True

Если имена столбцов не строковые литералы или конфликтуют с методами объекта DataFrame, доступ по именам атрибутов невозможен.

In [38]:
data.pop is data['pop']

False

Как и в случае с обсуждавшимися ранее объектами Series, такой «словарный» синтаксис можно применять для модификации объекта, например добавления еще одного столбца:

In [39]:
data['density'] = data['pop'] / data['area']

In [40]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### Объект DataFrame как двумерный массив

In [41]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

Можно выполнить множество привычных для массивов действий над объектом DataFrame. Например, транспонировать объект:

In [42]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [47]:
# указание отдельного индекса для массива означает доступ к строке
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [48]:
# указание отдельного "индекса" для объекта DataFrame - доступ к столбцу
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [54]:
data['area']['Texas']

695662

С помощью индексатора iloc можно индексировать исходный массив, как будто это простой массив NumPy (используя неявный синтаксис языка Python), но с сохранением в результирующих данных меток объекта DataFrame для индекса и столбцов:

In [55]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [59]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [60]:
# индексатор ix позволяет комбинировать эти два подхода:
data.ix[:3, :'pop']

/srv/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

В этих индексаторах можно использовать все уже знакомые вам паттерны доступа к данным в стиле библиотеки NumPy. Например, в индексаторе loc можно сочетать маскирование и «прихотливую» индексацию:

In [63]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [65]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [66]:
data.iloc[0, 2] = 90

In [67]:
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [73]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [78]:
data.loc['Texas':'Illinois', 'density']

Texas        38.018740
New York    139.076746
Florida     114.806121
Illinois     85.883763
Name: density, dtype: float64

In [80]:
data.iloc[:2, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193

In [81]:
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [93]:
data.loc[data['pop'] > 20000000, ['area', 'pop']]

              area       pop
California  423967  38332521
Texas       695662  26448193

In [107]:
data.iloc[:, :1]

              area
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

### Дополнительный синтаксис для индексации

Если индексация относится к строкам, то срезы относятся к столбцам

In [110]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [118]:
# в подобных срезах можно ссылаться на строки по номеру, а не по индексу
data[3:5]

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [119]:
# непосредственные операции маскирования также интерпретируются построчно, а не по столбцам
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121